spec/vcr/stripe/update_customer.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: UTF-8
      string: card[number]=4242424242424242&card[exp_month]=1&card[exp_year]=2030&card[cvc]=123
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/5.17.0
      Authorization:
      - Bearer <STRIPE_SECRET_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_llRkV6Kx2r48cr","request_duration_ms":495}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"5.17.0","lang":"ruby","lang_version":"2.6.0 p0 (2018-12-25)","platform":"x86_64-darwin19","engine":"ruby","publisher":"stripe","uname":"Darwin
        MB.local 19.4.0 Darwin Kernel Version 19.4.0: Wed Mar  4 22:28:40 PST 2020;
        root:xnu-6153.101.6~15/RELEASE_X86_64 x86_64","hostname":"MB.local"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 11 May 2020 10:13:00 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '784'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_moU5qlRLpk4YjP
      Stripe-Version:
      - '2018-11-08'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_1GhYd6HlQ4lxw7FZBOJ4FnpI",
          "object": "token",
          "card": {
            "id": "card_1GhYd6HlQ4lxw7FZBJg50WHG",
            "object": "card",
            "address_city": null,
            "address_country": null,
            "address_line1": null,
            "address_line1_check": null,
            "address_line2": null,
            "address_state": null,
            "address_zip": null,
            "address_zip_check": null,
            "brand": "Visa",
            "country": "US",
            "cvc_check": "unchecked",
            "dynamic_last4": null,
            "exp_month": 1,
            "exp_year": 2030,
            "fingerprint": "xDvEx6bRifNk7pxO",
            "funding": "credit",
            "last4": "4242",
            "metadata": {
            },
            "name": null,
            "tokenization_method": null
          },
          "client_ip": "119.240.42.1",
          "created": 1589191980,
          "livemode": false,
          "type": "card",
          "used": false
        }
    http_version: null
  recorded_at: Mon, 11 May 2020 10:13:00 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: UTF-8
      string: email=create_or_update_customer2%40bungomail.com&source=tok_1GhYd6HlQ4lxw7FZBOJ4FnpI
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/5.17.0
      Authorization:
      - Bearer <STRIPE_SECRET_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_moU5qlRLpk4YjP","request_duration_ms":319}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"5.17.0","lang":"ruby","lang_version":"2.6.0 p0 (2018-12-25)","platform":"x86_64-darwin19","engine":"ruby","publisher":"stripe","uname":"Darwin
        MB.local 19.4.0 Darwin Kernel Version 19.4.0: Wed Mar  4 22:28:40 PST 2020;
        root:xnu-6153.101.6~15/RELEASE_X86_64 x86_64","hostname":"MB.local"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 11 May 2020 10:13:01 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1947'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_xgnWSQUdAs8YDv
      Stripe-Version:
      - '2018-11-08'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_HG4m99v9JO4THx",
          "object": "customer",
          "account_balance": 0,
          "address": null,
          "balance": 0,
          "created": 1589191980,
          "currency": null,
          "default_source": "card_1GhYd6HlQ4lxw7FZBJg50WHG",
          "delinquent": false,
          "description": null,
          "discount": null,
          "email": "create_or_update_customer2@bungomail.com",
          "invoice_prefix": "77068999",
          "invoice_settings": {
            "custom_fields": null,
            "default_payment_method": null,
            "footer": null
          },
          "livemode": false,
          "metadata": {
          },
          "name": null,
          "next_invoice_sequence": 1,
          "phone": null,
          "preferred_locales": [

          ],
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [
              {
                "id": "card_1GhYd6HlQ4lxw7FZBJg50WHG",
                "object": "card",
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": null,
                "address_zip_check": null,
                "brand": "Visa",
                "country": "US",
                "customer": "cus_HG4m99v9JO4THx",
                "cvc_check": "pass",
                "dynamic_last4": null,
                "exp_month": 1,
                "exp_year": 2030,
                "fingerprint": "xDvEx6bRifNk7pxO",
                "funding": "credit",
                "last4": "4242",
                "metadata": {
                },
                "name": null,
                "tokenization_method": null
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_HG4m99v9JO4THx/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [

            ],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_HG4m99v9JO4THx/subscriptions"
          },
          "tax_exempt": "none",
          "tax_ids": {
            "object": "list",
            "data": [

            ],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_HG4m99v9JO4THx/tax_ids"
          },
          "tax_info": null,
          "tax_info_verification": null
        }
    http_version: null
  recorded_at: Mon, 11 May 2020 10:13:01 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: UTF-8
      string: card[number]=4242424242424242&card[exp_month]=5&card[exp_year]=2030&card[cvc]=123
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/5.17.0
      Authorization:
      - Bearer <STRIPE_SECRET_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_xgnWSQUdAs8YDv","request_duration_ms":422}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"5.17.0","lang":"ruby","lang_version":"2.6.0 p0 (2018-12-25)","platform":"x86_64-darwin19","engine":"ruby","publisher":"stripe","uname":"Darwin
        MB.local 19.4.0 Darwin Kernel Version 19.4.0: Wed Mar  4 22:28:40 PST 2020;
        root:xnu-6153.101.6~15/RELEASE_X86_64 x86_64","hostname":"MB.local"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 11 May 2020 10:13:01 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '784'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_wwMqlFI8jjY9HY
      Stripe-Version:
      - '2018-11-08'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_1GhYd7HlQ4lxw7FZOzhahVN5",
          "object": "token",
          "card": {
            "id": "card_1GhYd7HlQ4lxw7FZfV5P5YB6",
            "object": "card",
            "address_city": null,
            "address_country": null,
            "address_line1": null,
            "address_line1_check": null,
            "address_line2": null,
            "address_state": null,
            "address_zip": null,
            "address_zip_check": null,
            "brand": "Visa",
            "country": "US",
            "cvc_check": "unchecked",
            "dynamic_last4": null,
            "exp_month": 5,
            "exp_year": 2030,
            "fingerprint": "xDvEx6bRifNk7pxO",
            "funding": "credit",
            "last4": "4242",
            "metadata": {
            },
            "name": null,
            "tokenization_method": null
          },
          "client_ip": "119.240.42.1",
          "created": 1589191981,
          "livemode": false,
          "type": "card",
          "used": false
        }
    http_version: null
  recorded_at: Mon, 11 May 2020 10:13:01 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/customers/cus_HG4m99v9JO4THx
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/5.17.0
      Authorization:
      - Bearer <STRIPE_SECRET_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_wwMqlFI8jjY9HY","request_duration_ms":323}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"5.17.0","lang":"ruby","lang_version":"2.6.0 p0 (2018-12-25)","platform":"x86_64-darwin19","engine":"ruby","publisher":"stripe","uname":"Darwin
        MB.local 19.4.0 Darwin Kernel Version 19.4.0: Wed Mar  4 22:28:40 PST 2020;
        root:xnu-6153.101.6~15/RELEASE_X86_64 x86_64","hostname":"MB.local"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 11 May 2020 10:13:01 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1947'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_wapdZ78iObliy7
      Stripe-Version:
      - '2018-11-08'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_HG4m99v9JO4THx",
          "object": "customer",
          "account_balance": 0,
          "address": null,
          "balance": 0,
          "created": 1589191980,
          "currency": null,
          "default_source": "card_1GhYd6HlQ4lxw7FZBJg50WHG",
          "delinquent": false,
          "description": null,
          "discount": null,
          "email": "create_or_update_customer2@bungomail.com",
          "invoice_prefix": "77068999",
          "invoice_settings": {
            "custom_fields": null,
            "default_payment_method": null,
            "footer": null
          },
          "livemode": false,
          "metadata": {
          },
          "name": null,
          "next_invoice_sequence": 1,
          "phone": null,
          "preferred_locales": [

          ],
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [
              {
                "id": "card_1GhYd6HlQ4lxw7FZBJg50WHG",
                "object": "card",
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": null,
                "address_zip_check": null,
                "brand": "Visa",
                "country": "US",
                "customer": "cus_HG4m99v9JO4THx",
                "cvc_check": "pass",
                "dynamic_last4": null,
                "exp_month": 1,
                "exp_year": 2030,
                "fingerprint": "xDvEx6bRifNk7pxO",
                "funding": "credit",
                "last4": "4242",
                "metadata": {
                },
                "name": null,
                "tokenization_method": null
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_HG4m99v9JO4THx/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [

            ],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_HG4m99v9JO4THx/subscriptions"
          },
          "tax_exempt": "none",
          "tax_ids": {
            "object": "list",
            "data": [

            ],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_HG4m99v9JO4THx/tax_ids"
          },
          "tax_info": null,
          "tax_info_verification": null
        }
    http_version: null
  recorded_at: Mon, 11 May 2020 10:13:01 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers/cus_HG4m99v9JO4THx
    body:
      encoding: UTF-8
      string: source=tok_1GhYd7HlQ4lxw7FZOzhahVN5
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/5.17.0
      Authorization:
      - Bearer <STRIPE_SECRET_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics":{"request_id":"req_wapdZ78iObliy7","request_duration_ms":237}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"5.17.0","lang":"ruby","lang_version":"2.6.0 p0 (2018-12-25)","platform":"x86_64-darwin19","engine":"ruby","publisher":"stripe","uname":"Darwin
        MB.local 19.4.0 Darwin Kernel Version 19.4.0: Wed Mar  4 22:28:40 PST 2020;
        root:xnu-6153.101.6~15/RELEASE_X86_64 x86_64","hostname":"MB.local"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 11 May 2020 10:13:02 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1947'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_0HOsQuga5shYPM
      Stripe-Version:
      - '2018-11-08'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_HG4m99v9JO4THx",
          "object": "customer",
          "account_balance": 0,
          "address": null,
          "balance": 0,
          "created": 1589191980,
          "currency": null,
          "default_source": "card_1GhYd7HlQ4lxw7FZfV5P5YB6",
          "delinquent": false,
          "description": null,
          "discount": null,
          "email": "create_or_update_customer2@bungomail.com",
          "invoice_prefix": "77068999",
          "invoice_settings": {
            "custom_fields": null,
            "default_payment_method": null,
            "footer": null
          },
          "livemode": false,
          "metadata": {
          },
          "name": null,
          "next_invoice_sequence": 1,
          "phone": null,
          "preferred_locales": [

          ],
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [
              {
                "id": "card_1GhYd7HlQ4lxw7FZfV5P5YB6",
                "object": "card",
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": null,
                "address_zip_check": null,
                "brand": "Visa",
                "country": "US",
                "customer": "cus_HG4m99v9JO4THx",
                "cvc_check": "pass",
                "dynamic_last4": null,
                "exp_month": 5,
                "exp_year": 2030,
                "fingerprint": "xDvEx6bRifNk7pxO",
                "funding": "credit",
                "last4": "4242",
                "metadata": {
                },
                "name": null,
                "tokenization_method": null
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_HG4m99v9JO4THx/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [

            ],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_HG4m99v9JO4THx/subscriptions"
          },
          "tax_exempt": "none",
          "tax_ids": {
            "object": "list",
            "data": [

            ],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_HG4m99v9JO4THx/tax_ids"
          },
          "tax_info": null,
          "tax_info_verification": null
        }
    http_version: null
  recorded_at: Mon, 11 May 2020 10:13:02 GMT
recorded_with: VCR 5.1.0
